<a href="https://colab.research.google.com/github/A01735502/endendimientodelosdatos/blob/main/clase3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

df=pd.read_csv("trainLimpio.csv")
print(df.shape)
print(df.columns)

(838, 9)
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Ticket',
       'Fare', 'Embarked'],
      dtype='object')

In [ ]:
#SELECCIÓN

df2= df[['Survived', 'Pclass', 'Name', 'Sex','Age']]
print(df2.shape)

(838, 5)

In [ ]:
#FILTRADO DE MUJEREES


df3=df2[df2['Sex']=='female']
print(df3.shape)

(301, 5)

In [ ]:
#filtrado con query

query=df2['Sex']=="female"
df_mujeres=df2[query]
print(df_mujeres)
print(df_mujeres[['Name', 'Age','Survived']]) ##No imprimes otro df sino que solo con el que has creado le agregas columnas

     Survived  Pclass                                               Name  \
1           1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2           1       3                             Heikkinen, Miss. Laina
3           1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
7           1       3  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
8           1       2                Nasser, Mrs. Nicholas (Adele Achem)
..        ...     ...                                                ...
827         1       2       Shelley, Mrs. William (Imanita Parrish Hall)
829         0       3                       Dahlberg, Miss. Gerda Ulrika
832         0       3               Rice, Mrs. William (Margaret Norton)
834         1       1                       Graham, Miss. Margaret Edith
835         0       3           Johnston, Miss. Catherine Helen "Carrie"

        Sex   Age
1    female  38.0
2    female  26.0
3    female  35.0
7    female  27.0
8    female  14.0
..      ...   ...
827  female  25.0
829  female  22.0
832  female  39.0
834  female  19.0
835  female  23.0

[301 rows x 5 columns]
                                                  Name   Age  Survived
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0         1
2                               Heikkinen, Miss. Laina  26.0         1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0         1
7    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0         1
8                  Nasser, Mrs. Nicholas (Adele Achem)  14.0         1
..                                                 ...   ...       ...
827       Shelley, Mrs. William (Imanita Parrish Hall)  25.0         1
829                       Dahlberg, Miss. Gerda Ulrika  22.0         0
832               Rice, Mrs. William (Margaret Norton)  39.0         0
834                       Graham, Miss. Margaret Edith  19.0         1
835           Johnston, Miss. Catherine Helen "Carrie"  23.0         0

[301 rows x 3 columns]

In [ ]:
query=df2['Sex']=="male"
df_hombres=df2[query]
print(df_hombres)
print(df_hombres[['Name', 'Age','Survived']])

     Survived  Pclass                            Name   Sex   Age
0           0       3         Braund, Mr. Owen Harris  male  22.0
4           0       3        Allen, Mr. William Henry  male  35.0
5           0       1         McCarthy, Mr. Timothy J  male  54.0
6           0       3  Palsson, Master. Gosta Leonard  male   2.0
11          0       3  Saundercock, Mr. William Henry  male  20.0
..        ...     ...                             ...   ...   ...
830         0       2   Banfield, Mr. Frederick James  male  28.0
831         0       3          Sutehall, Mr. Henry Jr  male  25.0
833         0       2           Montvila, Rev. Juozas  male  27.0
836         1       1           Behr, Mr. Karl Howell  male  26.0
837         0       3             Dooley, Mr. Patrick  male  32.0

[537 rows x 5 columns]
                               Name   Age  Survived
0           Braund, Mr. Owen Harris  22.0         0
4          Allen, Mr. William Henry  35.0         0
5           McCarthy, Mr. Timothy J  54.0         0
6    Palsson, Master. Gosta Leonard   2.0         0
11   Saundercock, Mr. William Henry  20.0         0
..                              ...   ...       ...
830   Banfield, Mr. Frederick James  28.0         0
831          Sutehall, Mr. Henry Jr  25.0         0
833           Montvila, Rev. Juozas  27.0         0
836           Behr, Mr. Karl Howell  26.0         1
837             Dooley, Mr. Patrick  32.0         0

[537 rows x 3 columns]

In [ ]:
##listar los nombres, edades y clases de los hombres que no sorevivieron

query1=df2['Survived'] == 0
query2 =df2['Sex'] == "male"
df3=df2[query1 & query2]
print(df3.shape)
print(df3[['Name', 'Age', 'Pclass']])

(434, 5)
                               Name   Age  Pclass
0           Braund, Mr. Owen Harris  22.0       3
4          Allen, Mr. William Henry  35.0       3
5           McCarthy, Mr. Timothy J  54.0       1
6    Palsson, Master. Gosta Leonard   2.0       3
11   Saundercock, Mr. William Henry  20.0       3
..                              ...   ...     ...
828              Markun, Mr. Johann  33.0       3
830   Banfield, Mr. Frederick James  28.0       2
831          Sutehall, Mr. Henry Jr  25.0       3
833           Montvila, Rev. Juozas  27.0       2
837             Dooley, Mr. Patrick  32.0       3

[434 rows x 3 columns]

In [ ]:
## lista los nombres y edades de mujeres y niños

query3=df2['Age'] <18
query4=df2['Sex']=="female"
df4=df2[query3 | query4]
print(df4.shape)
print(df4[['Name', 'Age']])

(360, 5)
                                                  Name   Age
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
6                       Palsson, Master. Gosta Leonard   2.0
7    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0
..                                                 ...   ...
827       Shelley, Mrs. William (Imanita Parrish Hall)  25.0
829                       Dahlberg, Miss. Gerda Ulrika  22.0
832               Rice, Mrs. William (Margaret Norton)  39.0
834                       Graham, Miss. Margaret Edith  19.0
835           Johnston, Miss. Catherine Helen "Carrie"  23.0

[360 rows x 2 columns]

In [ ]:
##listas los pasajeros que sobrevivieron que no iban en 1ra clase
query1=df2['Pclass']!=1     ##   ! significa diferente
query2=df2['Survived']==1
df5=df2[query1 & query2]
print(df5.shape)
print(df5)

(192, 5)
     Survived  Pclass                                               Name  \
2           1       3                             Heikkinen, Miss. Laina
7           1       3  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
8           1       2                Nasser, Mrs. Nicholas (Adele Achem)
9           1       3                    Sandstrom, Miss. Marguerite Rut
14          1       2                   Hewlett, Mrs. (Mary D Kingcome)
..        ...     ...                                                ...
813         1       2                       Duran y More, Miss. Asuncion
816         1       3                    Johnson, Master. Harold Theodor
821         1       2              Abelson, Mrs. Samuel (Hannah Wizosky)
822         1       3                   Najib, Miss. Adele Kiamie "Jane"
827         1       2       Shelley, Mrs. William (Imanita Parrish Hall)

        Sex   Age
2    female  26.0
7    female  27.0
8    female  14.0
9    female   4.0
14   female  55.0
..      ...   ...
813  female  27.0
816    male   4.0
821  female  28.0
822  female  15.0
827  female  25.0

[192 rows x 5 columns]